<?php

return [
    'permissions' => [
        'websocket_*' => 'ユーザーがこのサーバーに対してwebsocket接続をできるようにします。',
        'control_console' => 'ユーザーがサーバーコンソールにデータを送信できるようにします。',
        'control_start' => 'ユーザーがサーバーインスタンスを起動できるようにします。',
        'control_stop' => 'ユーザーがサーバーインスタンスを停止できるようにします。',
        'control_restart' => 'ユーザーがサーバーインスタンスを再起動できるようにします。',
        'control_kill' => 'ユーザーがサーバーインスタンスを強制終了できるようにします。',
        'user_create' => 'ユーザーがサーバー上に新しいユーザーを作成できるようにします。',
        'user_read' => 'ユーザーがこのサーバーに関連付けられているユーザーを閲覧できるようにします。',
        'user_update' => 'ユーザーがこのサーバーに関連付けられている他のユーザーを変更できるようにします。',
        'user_delete' => 'ユーザーがこのサーバーに関連付けられている他のユーザーを削除できるようにします。',
        'file_create' => 'ユーザーがファイルとディレクトリを作成できるようにします。',
        'file_read' => 'ユーザーがこのサーバーインスタンスに関連付けられているファイルとフォルダを表示したり、それらの内容を表示したりできるようにします。',
        'file_update' => 'ユーザーがサーバーに関連付けられているファイルとフォルダを更新できるようにします。',
        'file_delete' => 'ユーザーがファイルとフォルダを削除できるようにします。',
        'file_archive' => 'ユーザーがファイルアーカイブを作成し、既存のアーカイブを展開できるようにします。',
        'file_sftp' => 'ユーザーがSFTPクライアントを使用して上記のファイルアクションを実行できるようにします。',
        //"割り当て" can be used instead of "アロケーション". However, this can be misleading.
        //This is pronounced "アロケーション" when reading katakana in English.
        //When translated into Japanese, it becomes an "割り当て", which may be unnatural.
        'allocation_read' => 'ユーザーがサーバーのアロケーション管理ページへアクセスできるようにします。',
        'allocation_update' => 'ユーザーがサーバーのアロケーションを変更できるようにします。',
        'database_create' => 'ユーザーがこのサーバーにデータベースを作成できるようにします。',
        'database_read' => 'ユーザーがこのサーバーのデータベースを閲覧できるようにします。',
        'database_update' => 'ユーザーがデータベースに変更を加えられるようにします。ユーザーが「View Password」権限を持っていない場合、ユーザーはパスワードを変更できません。',
        'database_delete' => 'ユーザーがデータベースインスタンスを削除できるようにします。',
        'database_view_password' => 'ユーザーがシステム内のデータベースパスワードを閲覧できるようにします。',
        'schedule_create' => 'ユーザーがこのサーバーにスケジュールを作成できるようにします。',
        'schedule_read' => 'ユーザーがこのサーバーのスケジュールを閲覧できるようにします。',
        'schedule_update' => 'ユーザーが既存のサーバースケジュールを変更できるようにします。',
        'schedule_delete' => 'ユーザーがこのサーバーのスケジュールを削除できるようにします。',
    ],
];
